# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-01-26 15:49:23 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* GuangNG [9/9]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-01-26 Mo 15:49]
   | Headline                                     | Time       |            |      |      |
   |----------------------------------------------+------------+------------+------+------|
   | *Total time*                                 | *1d 11:36* |            |      |      |
   |----------------------------------------------+------------+------------+------+------|
   | *GuangNG [9/9]*                              | *1d 11:36* |            |      |      |
   | \_  /Components [3/3]/                       |            | /1d 10:14/ |      |      |
   | \_    Main [0/0]                             |            |            | 0:15 |      |
   | \_    Model [0/0]                            |            |            | 1:37 |      |
   | \_    Database [1/1]                         |            |            | 5:33 |      |
   | \_      Add queries/methods for services     |            |            |      | 2:58 |
   | \_    Blacklist [0/0]                        |            |            | 1:08 |      |
   | \_      Testing                              |            |            |      | 0:12 |
   | \_    Generator [2/2]                        |            |            | 9:28 |      |
   | \_      Sanity-check zones for XFR           |            |            |      | 0:47 |
   | \_    XFR [0/0]                              |            |            | 5:52 |      |
   | \_    Scanner [0/0]                          |            |            | 8:35 |      |
   | \_    Nexus [0/0]                            |            |            | 1:46 |      |
   | \_  /Features [4/4]/                         |            | /0:43/     |      |      |
   | \_    Allow starting subsystems with zero... |            |            | 0:43 |      |
   | \_      Generator                            |            |            |      | 0:18 |
   | \_      XFR                                  |            |            |      | 0:07 |
   | \_      Scanner                              |            |            |      | 0:14 |
   | \_  /Bugs [2/2]/                             |            | /0:39/     |      |      |
   | \_    Query XFRAdd did not return a value    |            |            | 0:13 |      |
   | \_    Segmentation Violation Blues           |            |            | 0:26 |      |
   #+END:
** Components [3/3]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Main [0/0]
    :LOGBOOK:
    CLOCK: [2026-01-19 Mo 19:25]--[2026-01-19 Mo 19:40] =>  0:15
    :END:
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-20 Di 13:28]--[2026-01-20 Di 13:33] =>  0:05
    CLOCK: [2026-01-12 Mo 15:30]--[2026-01-12 Mo 15:32] =>  0:02
    CLOCK: [2026-01-11 So 16:51]--[2026-01-11 So 18:21] =>  1:30
    :END:
*** Database [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-21 Mi 15:45]--[2026-01-21 Mi 16:01] =>  0:16
    CLOCK: [2026-01-20 Di 14:02]--[2026-01-20 Di 14:12] =>  0:10
    CLOCK: [2026-01-15 Do 21:10]--[2026-01-15 Do 21:15] =>  0:05
    CLOCK: [2026-01-15 Do 20:18]--[2026-01-15 Do 20:57] =>  0:39
    CLOCK: [2026-01-12 Mo 16:21]--[2026-01-12 Mo 16:58] =>  0:37
    CLOCK: [2026-01-12 Mo 15:32]--[2026-01-12 Mo 16:10] =>  0:38
    CLOCK: [2026-01-12 Mo 15:20]--[2026-01-12 Mo 15:30] =>  0:10
    :END:
**** DONE Add queries/methods for services
     CLOSED: [2026-01-23 Fr 16:19]
     :LOGBOOK:
     CLOCK: [2026-01-23 Fr 15:17]--[2026-01-23 Fr 16:19] =>  1:02
     CLOCK: [2026-01-22 Do 16:52]--[2026-01-22 Do 18:48] =>  1:56
     :END:
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-12 Mo 14:05]--[2026-01-12 Mo 15:01] =>  0:56
    :END:
**** Testing
     :LOGBOOK:
     CLOCK: [2026-01-12 Mo 15:06]--[2026-01-12 Mo 15:18] =>  0:12
     :END:
*** Generator [2/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-16 Fr 16:59]--[2026-01-16 Fr 19:10] =>  2:11
    CLOCK: [2026-01-15 Do 21:15]--[2026-01-15 Do 21:35] =>  0:20
    CLOCK: [2026-01-15 Do 19:21]--[2026-01-15 Do 20:18] =>  0:57
    CLOCK: [2026-01-15 Do 17:26]--[2026-01-15 Do 18:57] =>  1:31
    CLOCK: [2026-01-14 Mi 19:17]--[2026-01-14 Mi 21:37] =>  2:20
    CLOCK: [2026-01-12 Mo 21:27]--[2026-01-12 Mo 22:49] =>  1:22
    :END:
**** DONE Unclutter log output
     CLOSED: [2026-01-19 Mo 20:58]
**** DONE Sanity-check zones for XFR
     CLOSED: [2026-01-19 Mo 20:58]
     :LOGBOOK:
     CLOCK: [2026-01-19 Mo 20:11]--[2026-01-19 Mo 20:58] =>  0:47
     :END:
     I have one example, of the "com." zone. We definitely don't want to query
     top-level domains, even if they let us do an AXFR. *Especially* if they
     let us, those must be humongous.
*** XFR [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-22 Do 14:25]--[2026-01-22 Do 14:47] =>  0:22
    CLOCK: [2026-01-21 Mi 17:41]--[2026-01-21 Mi 19:17] =>  1:36
    CLOCK: [2026-01-21 Mi 16:01]--[2026-01-21 Mi 16:19] =>  0:18
    CLOCK: [2026-01-21 Mi 14:03]--[2026-01-21 Mi 15:45] =>  1:42
    CLOCK: [2026-01-20 Di 16:36]--[2026-01-20 Di 17:12] =>  0:36
    CLOCK: [2026-01-20 Di 14:13]--[2026-01-20 Di 15:05] =>  0:52
    CLOCK: [2026-01-20 Di 13:36]--[2026-01-20 Di 14:02] =>  0:26
    :END:
    Alright, let's see how this one goes.
*** Scanner [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-25 So 18:17]--[2026-01-25 So 19:03] =>  0:46
    CLOCK: [2026-01-24 Sa 13:43]--[2026-01-24 Sa 17:57] =>  4:14
    CLOCK: [2026-01-23 Fr 16:47]--[2026-01-23 Fr 18:45] =>  1:58
    CLOCK: [2026-01-22 Do 15:50]--[2026-01-22 Do 16:51] =>  1:01
    CLOCK: [2026-01-22 Do 15:09]--[2026-01-22 Do 15:45] =>  0:36
    :END:
*** Nexus [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-26 Mo 13:46]--[2026-01-26 Mo 14:04] =>  0:18
    CLOCK: [2026-01-19 Mo 18:47]--[2026-01-19 Mo 19:25] =>  0:38
    CLOCK: [2026-01-16 Fr 19:10]--[2026-01-16 Fr 20:00] =>  0:50
    :END:
*** Web UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
** Features [4/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Allow starting subsystems with zero workers [3/3]
    CLOSED: [2026-01-26 Mo 15:22]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-26 Mo 14:39]--[2026-01-26 Mo 14:43] =>  0:04
    :END:
**** DONE Generator
     CLOSED: [2026-01-26 Mo 15:08]
     :LOGBOOK:
     CLOCK: [2026-01-26 Mo 14:43]--[2026-01-26 Mo 15:01] =>  0:18
     :END:
**** DONE XFR
     CLOSED: [2026-01-26 Mo 15:08]
     :LOGBOOK:
     CLOCK: [2026-01-26 Mo 15:01]--[2026-01-26 Mo 15:08] =>  0:07
     :END:
**** DONE Scanner
     CLOSED: [2026-01-26 Mo 15:22]
     :LOGBOOK:
     CLOCK: [2026-01-26 Mo 15:08]--[2026-01-26 Mo 15:22] =>  0:14
     :END:
** Bugs [2/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Query XFRAdd did not return a value
    CLOSED: [2026-01-19 Mo 20:00]
    :LOGBOOK:
    CLOCK: [2026-01-19 Mo 19:47]--[2026-01-19 Mo 20:00] =>  0:13
    :END:
    My first attempt at running the Generator gives the above error
    message. Let's see what's going on there.
    ...
    Turns out it was due to a badly written table constraint.
    I rewrote the constraint, the error message no longer appears. (For now.)
*** DONE Segmentation Violation Blues
    CLOSED: [2026-01-26 Mo 15:49]
    :LOGBOOK:
    CLOCK: [2026-01-26 Mo 15:23]--[2026-01-26 Mo 15:49] =>  0:26
    :END:
